IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_CMDDATAECC0" width="32" offset="0x11B0" description="Command Data Register ECC 0">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC1" width="32" offset="0x11B4" description="Command Data Register ECC 1">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC2" width="32" offset="0x11B8" description="Command Data Register ECC 2">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC3" width="32" offset="0x11BC" description="Command Data Register ECC 3">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC4" width="32" offset="0x11C0" description="Command Data Register ECC 4">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC5" width="32" offset="0x11C4" description="Command Data Register ECC 5">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC6" width="32" offset="0x11C8" description="Command Data Register ECC 6">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC7" width="32" offset="0x11CC" description="Command Data Register ECC 7">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTA" width="32" offset="0x11D0" description="Command Write Erase Protect A Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
