IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_BANK4INFO0" width="32" offset="0x1440" description="Bank Information Register 0 for Bank 4">
        <bitfield id="MAINSIZE" description="Main region size in sectors" begin="11" end="0" width="12" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x8" description="Minimum value of [MAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x200" description="Maximum value of [MAINSIZE]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_BANK4INFO1" width="32" offset="0x1444" description="Bank Information Register 1 for Bank 4">
        <bitfield id="NONMAINSIZE" description="Non-main region size in sectors" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [NONMAINSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [NONMAINSIZE]"/>
        </bitfield>
        <bitfield id="TRIMSIZE" description="Trim region size in sectors" begin="15" end="8" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [TRIMSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [TRIMSIZE]"/>
        </bitfield>
        <bitfield id="ENGRSIZE" description="Engr region size in sectors" begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MINSECTORS" value="0x0" description="Minimum value of [ENGRSIZE]"/>
            <bitenum id="MAXSECTORS" value="0x20" description="Maximum value of [ENGRSIZE]"/>
        </bitfield>
    </register>
</module>
